GopalSaraf/Practicals/PSDL/include/proc/pic16f18026.inc
// Register: PWM3DCL
#define PWM3DCL PWM3DCL
PWM3DCL                                  equ 040Ch
// bitfield definitions
PWM3DCL_DCL_POSN                         equ 0006h
PWM3DCL_DCL_POSITION                     equ 0006h
PWM3DCL_DCL_SIZE                         equ 0002h
PWM3DCL_DCL_LENGTH                       equ 0002h
PWM3DCL_DCL_MASK                         equ 00C0h

// Register: PWM3DCH
#define PWM3DCH PWM3DCH
PWM3DCH                                  equ 040Dh
// bitfield definitions
PWM3DCH_DCH_POSN                         equ 0000h
PWM3DCH_DCH_POSITION                     equ 0000h
PWM3DCH_DCH_SIZE                         equ 0008h
PWM3DCH_DCH_LENGTH                       equ 0008h
PWM3DCH_DCH_MASK                         equ 00FFh

// Register: PWM3CON
#define PWM3CON PWM3CON
PWM3CON                                  equ 040Eh
// bitfield definitions
PWM3CON_POL_POSN                         equ 0004h
PWM3CON_POL_POSITION                     equ 0004h
PWM3CON_POL_SIZE                         equ 0001h
PWM3CON_POL_LENGTH                       equ 0001h
PWM3CON_POL_MASK                         equ 0010h
PWM3CON_OUT_POSN                         equ 0005h
PWM3CON_OUT_POSITION                     equ 0005h
PWM3CON_OUT_SIZE                         equ 0001h
PWM3CON_OUT_LENGTH                       equ 0001h
PWM3CON_OUT_MASK                         equ 0020h
PWM3CON_EN_POSN                          equ 0007h
PWM3CON_EN_POSITION                      equ 0007h
PWM3CON_EN_SIZE                          equ 0001h
PWM3CON_EN_LENGTH                        equ 0001h
PWM3CON_EN_MASK                          equ 0080h
PWM3CON_PWM3POL_POSN                     equ 0004h
PWM3CON_PWM3POL_POSITION                 equ 0004h
PWM3CON_PWM3POL_SIZE                     equ 0001h
PWM3CON_PWM3POL_LENGTH                   equ 0001h
PWM3CON_PWM3POL_MASK                     equ 0010h
PWM3CON_PWM3OUT_POSN                     equ 0005h
PWM3CON_PWM3OUT_POSITION                 equ 0005h
PWM3CON_PWM3OUT_SIZE                     equ 0001h
PWM3CON_PWM3OUT_LENGTH                   equ 0001h
PWM3CON_PWM3OUT_MASK                     equ 0020h
PWM3CON_PWM3EN_POSN                      equ 0007h
PWM3CON_PWM3EN_POSITION                  equ 0007h
PWM3CON_PWM3EN_SIZE                      equ 0001h
PWM3CON_PWM3EN_LENGTH                    equ 0001h
PWM3CON_PWM3EN_MASK                      equ 0080h

// Register: PWM4DCL
#define PWM4DCL PWM4DCL
PWM4DCL                                  equ 040Fh
// bitfield definitions
PWM4DCL_DCL_POSN                         equ 0006h
PWM4DCL_DCL_POSITION                     equ 0006h
PWM4DCL_DCL_SIZE                         equ 0002h
PWM4DCL_DCL_LENGTH                       equ 0002h
PWM4DCL_DCL_MASK                         equ 00C0h

// Register: PWM4DCH
#define PWM4DCH PWM4DCH
PWM4DCH                                  equ 0410h
// bitfield definitions
PWM4DCH_DCH_POSN                         equ 0000h
PWM4DCH_DCH_POSITION                     equ 0000h
PWM4DCH_DCH_SIZE                         equ 0008h
PWM4DCH_DCH_LENGTH                       equ 0008h
PWM4DCH_DCH_MASK                         equ 00FFh

// Register: PWM4CON
#define PWM4CON PWM4CON
PWM4CON                                  equ 0411h
// bitfield definitions
PWM4CON_POL_POSN                         equ 0004h
PWM4CON_POL_POSITION                     equ 0004h
PWM4CON_POL_SIZE                         equ 0001h
PWM4CON_POL_LENGTH                       equ 0001h
PWM4CON_POL_MASK                         equ 0010h
PWM4CON_OUT_POSN                         equ 0005h
PWM4CON_OUT_POSITION                     equ 0005h
PWM4CON_OUT_SIZE                         equ 0001h
PWM4CON_OUT_LENGTH                       equ 0001h
PWM4CON_OUT_MASK                         equ 0020h
PWM4CON_EN_POSN                          equ 0007h
PWM4CON_EN_POSITION                      equ 0007h
PWM4CON_EN_SIZE                          equ 0001h
PWM4CON_EN_LENGTH                        equ 0001h
PWM4CON_EN_MASK                          equ 0080h
PWM4CON_PWM4POL_POSN                     equ 0004h
PWM4CON_PWM4POL_POSITION                 equ 0004h
PWM4CON_PWM4POL_SIZE                     equ 0001h
PWM4CON_PWM4POL_LENGTH                   equ 0001h
PWM4CON_PWM4POL_MASK                     equ 0010h
PWM4CON_PWM4OUT_POSN                     equ 0005h
PWM4CON_PWM4OUT_POSITION                 equ 0005h
PWM4CON_PWM4OUT_SIZE                     equ 0001h
PWM4CON_PWM4OUT_LENGTH                   equ 0001h
PWM4CON_PWM4OUT_MASK                     equ 0020h
PWM4CON_PWM4EN_POSN                      equ 0007h
PWM4CON_PWM4EN_POSITION                  equ 0007h
PWM4CON_PWM4EN_SIZE                      equ 0001h
PWM4CON_PWM4EN_LENGTH                    equ 0001h
PWM4CON_PWM4EN_MASK                      equ 0080h

// Register: PWM5DCL
#define PWM5DCL PWM5DCL
PWM5DCL                                  equ 0412h
// bitfield definitions
PWM5DCL_DCL_POSN                         equ 0006h
PWM5DCL_DCL_POSITION                     equ 0006h
PWM5DCL_DCL_SIZE                         equ 0002h
PWM5DCL_DCL_LENGTH                       equ 0002h
PWM5DCL_DCL_MASK                         equ 00C0h

// Register: PWM5DCH
#define PWM5DCH PWM5DCH
PWM5DCH                                  equ 0413h
// bitfield definitions
PWM5DCH_DCH_POSN                         equ 0000h
PWM5DCH_DCH_POSITION                     equ 0000h
PWM5DCH_DCH_SIZE                         equ 0008h
PWM5DCH_DCH_LENGTH                       equ 0008h
PWM5DCH_DCH_MASK                         equ 00FFh

// Register: PWM5CON
#define PWM5CON PWM5CON
PWM5CON                                  equ 0414h
// bitfield definitions
PWM5CON_POL_POSN                         equ 0004h
PWM5CON_POL_POSITION                     equ 0004h
PWM5CON_POL_SIZE                         equ 0001h
PWM5CON_POL_LENGTH                       equ 0001h
PWM5CON_POL_MASK                         equ 0010h
PWM5CON_OUT_POSN                         equ 0005h
PWM5CON_OUT_POSITION                     equ 0005h
PWM5CON_OUT_SIZE                         equ 0001h
PWM5CON_OUT_LENGTH                       equ 0001h
PWM5CON_OUT_MASK                         equ 0020h
PWM5CON_EN_POSN                          equ 0007h
PWM5CON_EN_POSITION                      equ 0007h
PWM5CON_EN_SIZE                          equ 0001h
PWM5CON_EN_LENGTH                        equ 0001h
PWM5CON_EN_MASK                          equ 0080h
PWM5CON_PWM5POL_POSN                     equ 0004h
PWM5CON_PWM5POL_POSITION                 equ 0004h
PWM5CON_PWM5POL_SIZE                     equ 0001h
PWM5CON_PWM5POL_LENGTH                   equ 0001h
PWM5CON_PWM5POL_MASK                     equ 0010h
PWM5CON_PWM5OUT_POSN                     equ 0005h
PWM5CON_PWM5OUT_POSITION                 equ 0005h
PWM5CON_PWM5OUT_SIZE                     equ 0001h
PWM5CON_PWM5OUT_LENGTH                   equ 0001h
PWM5CON_PWM5OUT_MASK                     equ 0020h
PWM5CON_PWM5EN_POSN                      equ 0007h
PWM5CON_PWM5EN_POSITION                  equ 0007h
PWM5CON_PWM5EN_SIZE                      equ 0001h
PWM5CON_PWM5EN_LENGTH                    equ 0001h
PWM5CON_PWM5EN_MASK                      equ 0080h

// Register: PWMTMRS0
#define PWMTMRS0 PWMTMRS0
PWMTMRS0                                 equ 041Fh
// bitfield definitions
PWMTMRS0_P3TSEL_POSN                     equ 0000h
PWMTMRS0_P3TSEL_POSITION                 equ 0000h
PWMTMRS0_P3TSEL_SIZE                     equ 0002h
PWMTMRS0_P3TSEL_LENGTH                   equ 0002h
PWMTMRS0_P3TSEL_MASK                     equ 0003h
PWMTMRS0_P4TSEL_POSN                     equ 0002h
PWMTMRS0_P4TSEL_POSITION                 equ 0002h
PWMTMRS0_P4TSEL_SIZE                     equ 0002h
PWMTMRS0_P4TSEL_LENGTH                   equ 0002h
PWMTMRS0_P4TSEL_MASK                     equ 000Ch
PWMTMRS0_P5TSEL_POSN                     equ 0004h
PWMTMRS0_P5TSEL_POSITION                 equ 0004h
PWMTMRS0_P5TSEL_SIZE                     equ 0002h
PWMTMRS0_P5TSEL_LENGTH                   equ 0002h
PWMTMRS0_P5TSEL_MASK                     equ 0030h

