GopalSaraf/Practicals/PSDL/include/proc/pic16f18026.inc
// Register: CM1NCH
#define CM1NCH CM1NCH
CM1NCH                                   equ 0108Eh
// bitfield definitions
CM1NCH_NCH_POSN                          equ 0000h
CM1NCH_NCH_POSITION                      equ 0000h
CM1NCH_NCH_SIZE                          equ 0003h
CM1NCH_NCH_LENGTH                        equ 0003h
CM1NCH_NCH_MASK                          equ 0007h
CM1NCH_NCH0_POSN                         equ 0000h
CM1NCH_NCH0_POSITION                     equ 0000h
CM1NCH_NCH0_SIZE                         equ 0001h
CM1NCH_NCH0_LENGTH                       equ 0001h
CM1NCH_NCH0_MASK                         equ 0001h
CM1NCH_NCH1_POSN                         equ 0001h
CM1NCH_NCH1_POSITION                     equ 0001h
CM1NCH_NCH1_SIZE                         equ 0001h
CM1NCH_NCH1_LENGTH                       equ 0001h
CM1NCH_NCH1_MASK                         equ 0002h
CM1NCH_NCH2_POSN                         equ 0002h
CM1NCH_NCH2_POSITION                     equ 0002h
CM1NCH_NCH2_SIZE                         equ 0001h
CM1NCH_NCH2_LENGTH                       equ 0001h
CM1NCH_NCH2_MASK                         equ 0004h
CM1NCH_C1NCH0_POSN                       equ 0000h
CM1NCH_C1NCH0_POSITION                   equ 0000h
CM1NCH_C1NCH0_SIZE                       equ 0001h
CM1NCH_C1NCH0_LENGTH                     equ 0001h
CM1NCH_C1NCH0_MASK                       equ 0001h
CM1NCH_C1NCH1_POSN                       equ 0001h
CM1NCH_C1NCH1_POSITION                   equ 0001h
CM1NCH_C1NCH1_SIZE                       equ 0001h
CM1NCH_C1NCH1_LENGTH                     equ 0001h
CM1NCH_C1NCH1_MASK                       equ 0002h
CM1NCH_C1NCH2_POSN                       equ 0002h
CM1NCH_C1NCH2_POSITION                   equ 0002h
CM1NCH_C1NCH2_SIZE                       equ 0001h
CM1NCH_C1NCH2_LENGTH                     equ 0001h
CM1NCH_C1NCH2_MASK                       equ 0004h

// Register: CM1PCH
#define CM1PCH CM1PCH
CM1PCH                                   equ 0108Fh
// bitfield definitions
CM1PCH_PCH_POSN                          equ 0000h
CM1PCH_PCH_POSITION                      equ 0000h
CM1PCH_PCH_SIZE                          equ 0003h
CM1PCH_PCH_LENGTH                        equ 0003h
CM1PCH_PCH_MASK                          equ 0007h
CM1PCH_PCH0_POSN                         equ 0000h
CM1PCH_PCH0_POSITION                     equ 0000h
CM1PCH_PCH0_SIZE                         equ 0001h
CM1PCH_PCH0_LENGTH                       equ 0001h
CM1PCH_PCH0_MASK                         equ 0001h
CM1PCH_PCH1_POSN                         equ 0001h
CM1PCH_PCH1_POSITION                     equ 0001h
CM1PCH_PCH1_SIZE                         equ 0001h
CM1PCH_PCH1_LENGTH                       equ 0001h
CM1PCH_PCH1_MASK                         equ 0002h
CM1PCH_PCH2_POSN                         equ 0002h
CM1PCH_PCH2_POSITION                     equ 0002h
CM1PCH_PCH2_SIZE                         equ 0001h
CM1PCH_PCH2_LENGTH                       equ 0001h
CM1PCH_PCH2_MASK                         equ 0004h
CM1PCH_C1PCH0_POSN                       equ 0000h
CM1PCH_C1PCH0_POSITION                   equ 0000h
CM1PCH_C1PCH0_SIZE                       equ 0001h
CM1PCH_C1PCH0_LENGTH                     equ 0001h
CM1PCH_C1PCH0_MASK                       equ 0001h
CM1PCH_C1PCH1_POSN                       equ 0001h
CM1PCH_C1PCH1_POSITION                   equ 0001h
CM1PCH_C1PCH1_SIZE                       equ 0001h
CM1PCH_C1PCH1_LENGTH                     equ 0001h
CM1PCH_C1PCH1_MASK                       equ 0002h
CM1PCH_C1PCH2_POSN                       equ 0002h
CM1PCH_C1PCH2_POSITION                   equ 0002h
CM1PCH_C1PCH2_SIZE                       equ 0001h
CM1PCH_C1PCH2_LENGTH                     equ 0001h
CM1PCH_C1PCH2_MASK                       equ 0004h

// Register: CMOUT
#define CMOUT CMOUT
CMOUT                                    equ 0109Fh
// bitfield definitions
CMOUT_C1OUT_POSN                         equ 0000h
CMOUT_C1OUT_POSITION                     equ 0000h
CMOUT_C1OUT_SIZE                         equ 0001h
CMOUT_C1OUT_LENGTH                       equ 0001h
CMOUT_C1OUT_MASK                         equ 0001h

// Register: DAC1CON
#define DAC1CON DAC1CON
DAC1CON                                  equ 0110Ch
// bitfield definitions
DAC1CON_NSS_POSN                         equ 0000h
DAC1CON_NSS_POSITION                     equ 0000h
DAC1CON_NSS_SIZE                         equ 0001h
DAC1CON_NSS_LENGTH                       equ 0001h
DAC1CON_NSS_MASK                         equ 0001h
DAC1CON_PSS_POSN                         equ 0002h
DAC1CON_PSS_POSITION                     equ 0002h
DAC1CON_PSS_SIZE                         equ 0002h
DAC1CON_PSS_LENGTH                       equ 0002h
DAC1CON_PSS_MASK                         equ 000Ch
DAC1CON_OE_POSN                          equ 0004h
DAC1CON_OE_POSITION                      equ 0004h
DAC1CON_OE_SIZE                          equ 0002h
DAC1CON_OE_LENGTH                        equ 0002h
DAC1CON_OE_MASK                          equ 0030h
DAC1CON_REFRNG_POSN                      equ 0006h
DAC1CON_REFRNG_POSITION                  equ 0006h
DAC1CON_REFRNG_SIZE                      equ 0001h
DAC1CON_REFRNG_LENGTH                    equ 0001h
DAC1CON_REFRNG_MASK                      equ 0040h
DAC1CON_EN_POSN                          equ 0007h
DAC1CON_EN_POSITION                      equ 0007h
DAC1CON_EN_SIZE                          equ 0001h
DAC1CON_EN_LENGTH                        equ 0001h
DAC1CON_EN_MASK                          equ 0080h
DAC1CON_PSS0_POSN                        equ 0002h
DAC1CON_PSS0_POSITION                    equ 0002h
DAC1CON_PSS0_SIZE                        equ 0001h
DAC1CON_PSS0_LENGTH                      equ 0001h
DAC1CON_PSS0_MASK                        equ 0004h
DAC1CON_PSS1_POSN                        equ 0003h
DAC1CON_PSS1_POSITION                    equ 0003h
DAC1CON_PSS1_SIZE                        equ 0001h
DAC1CON_PSS1_LENGTH                      equ 0001h
DAC1CON_PSS1_MASK                        equ 0008h
DAC1CON_OE0_POSN                         equ 0004h
DAC1CON_OE0_POSITION                     equ 0004h
DAC1CON_OE0_SIZE                         equ 0001h
DAC1CON_OE0_LENGTH                       equ 0001h
DAC1CON_OE0_MASK                         equ 0010h
DAC1CON_OE1_POSN                         equ 0005h
DAC1CON_OE1_POSITION                     equ 0005h
DAC1CON_OE1_SIZE                         equ 0001h
DAC1CON_OE1_LENGTH                       equ 0001h
DAC1CON_OE1_MASK                         equ 0020h

