GopalSaraf/Practicals/PSDL/include/proc/pic16f18026.inc
#define IOCAN0                           BANKMASK(IOCAN), 0
#define IOCAN1                           BANKMASK(IOCAN), 1
#define IOCAN2                           BANKMASK(IOCAN), 2
#define IOCAN3                           BANKMASK(IOCAN), 3
#define IOCAN4                           BANKMASK(IOCAN), 4
#define IOCAN5                           BANKMASK(IOCAN), 5
#define IOCAP0                           BANKMASK(IOCAP), 0
#define IOCAP1                           BANKMASK(IOCAP), 1
#define IOCAP2                           BANKMASK(IOCAP), 2
#define IOCAP3                           BANKMASK(IOCAP), 3
#define IOCAP4                           BANKMASK(IOCAP), 4
#define IOCAP5                           BANKMASK(IOCAP), 5
#define IOCCF0                           BANKMASK(IOCCF), 0
#define IOCCF1                           BANKMASK(IOCCF), 1
#define IOCCF2                           BANKMASK(IOCCF), 2
#define IOCCF3                           BANKMASK(IOCCF), 3
#define IOCCF4                           BANKMASK(IOCCF), 4
#define IOCCF5                           BANKMASK(IOCCF), 5
#define IOCCN0                           BANKMASK(IOCCN), 0
#define IOCCN1                           BANKMASK(IOCCN), 1
#define IOCCN2                           BANKMASK(IOCCN), 2
#define IOCCN3                           BANKMASK(IOCCN), 3
#define IOCCN4                           BANKMASK(IOCCN), 4
#define IOCCN5                           BANKMASK(IOCCN), 5
#define IOCCP0                           BANKMASK(IOCCP), 0
#define IOCCP1                           BANKMASK(IOCCP), 1
#define IOCCP2                           BANKMASK(IOCCP), 2
#define IOCCP3                           BANKMASK(IOCCP), 3
#define IOCCP4                           BANKMASK(IOCCP), 4
#define IOCCP5                           BANKMASK(IOCCP), 5
#define IOCIE                            BANKMASK(PIE0), 4
#define IOCIF                            BANKMASK(PIR0), 4
#define IPEN                             BANKMASK(ADCON1), 6
#define ISM0                             BANKMASK(CWG1ISM), 0
#define ISM1                             BANKMASK(CWG1ISM), 1
#define ISM2                             BANKMASK(CWG1ISM), 2
#define ISM3                             BANKMASK(CWG1ISM), 3
#define LATA0                            BANKMASK(LATA), 0
#define LATA1                            BANKMASK(LATA), 1
#define LATA2                            BANKMASK(LATA), 2
#define LATA4                            BANKMASK(LATA), 4
#define LATA5                            BANKMASK(LATA), 5
#define LATC0                            BANKMASK(LATC), 0
#define LATC1                            BANKMASK(LATC), 1
#define LATC2                            BANKMASK(LATC), 2
#define LATC3                            BANKMASK(LATC), 3
#define LATC4                            BANKMASK(LATC), 4
#define LATC5                            BANKMASK(LATC), 5
#define LD                               BANKMASK(CWG1CON0), 6
#define LFOEN                            BANKMASK(OSCEN), 4
#define LFOR                             BANKMASK(OSCSTAT), 4
#define LSAC0                            BANKMASK(CWG1AS0), 2
#define LSBD0                            BANKMASK(CWG1AS0), 4
#define LSBD1                            BANKMASK(CWG1AS0), 5
#define LSCA1                            BANKMASK(CWG1AS0), 3
#define LTH0                             BANKMASK(ADLTHL), 0
#define LTH1                             BANKMASK(ADLTHL), 1
#define LTH10                            BANKMASK(ADLTHH), 2
#define LTH11                            BANKMASK(ADLTHH), 3
#define LTH12                            BANKMASK(ADLTHH), 4
#define LTH13                            BANKMASK(ADLTHH), 5
#define LTH14                            BANKMASK(ADLTHH), 6
#define LTH15                            BANKMASK(ADLTHH), 7
#define LTH2                             BANKMASK(ADLTHL), 2
#define LTH3                             BANKMASK(ADLTHL), 3
#define LTH4                             BANKMASK(ADLTHL), 4
#define LTH5                             BANKMASK(ADLTHL), 5
#define LTH6                             BANKMASK(ADLTHL), 6
#define LTH7                             BANKMASK(ADLTHL), 7
#define LTH8                             BANKMASK(ADLTHH), 0
#define LTH9                             BANKMASK(ADLTHH), 1
#define LTHR                             BANKMASK(ADSTAT), 5
#define LWLO                             BANKMASK(NVMCON1), 5
#define MATH                             BANKMASK(ADSTAT), 4
#define MD0                              BANKMASK(ADCON2), 0
#define MD1                              BANKMASK(ADCON2), 1
#define MD16                             BANKMASK(T0CON0), 4
#define MD2                              BANKMASK(ADCON2), 2
#define MFOEN                            BANKMASK(OSCEN), 5
#define MFOR                             BANKMASK(OSCSTAT), 5
#define MSK01                            BANKMASK(SSP1ADD), 0
#define MSK02                            BANKMASK(SSP2ADD), 0
#define MSK11                            BANKMASK(SSP1ADD), 1
#define MSK12                            BANKMASK(SSP2ADD), 1
#define MSK21                            BANKMASK(SSP1ADD), 2
#define MSK22                            BANKMASK(SSP2ADD), 2
#define MSK31                            BANKMASK(SSP1ADD), 3
#define MSK32                            BANKMASK(SSP2ADD), 3
#define MSK41                            BANKMASK(SSP1ADD), 4
#define MSK42                            BANKMASK(SSP2ADD), 4
#define MSK51                            BANKMASK(SSP1ADD), 5
#define MSK52                            BANKMASK(SSP2ADD), 5
#define MSK61                            BANKMASK(SSP1ADD), 6
#define MSK62                            BANKMASK(SSP2ADD), 6
#define MSK71                            BANKMASK(SSP1ADD), 7
#define MSK72                            BANKMASK(SSP2ADD), 7
#define NCH0                             BANKMASK(CM1NCH), 0
#define NCH1                             BANKMASK(CM1NCH), 1
#define NCH2                             BANKMASK(CM1NCH), 2
#define NCO1ACC0                         BANKMASK(NCO1ACCL), 0
#define NCO1ACC1                         BANKMASK(NCO1ACCL), 1
#define NCO1ACC10                        BANKMASK(NCO1ACCH), 2
#define NCO1ACC11                        BANKMASK(NCO1ACCH), 3
#define NCO1ACC12                        BANKMASK(NCO1ACCH), 4
#define NCO1ACC13                        BANKMASK(NCO1ACCH), 5
#define NCO1ACC14                        BANKMASK(NCO1ACCH), 6
#define NCO1ACC15                        BANKMASK(NCO1ACCH), 7
#define NCO1ACC16                        BANKMASK(NCO1ACCU), 0
#define NCO1ACC17                        BANKMASK(NCO1ACCU), 1
#define NCO1ACC18                        BANKMASK(NCO1ACCU), 2
#define NCO1ACC19                        BANKMASK(NCO1ACCU), 3
#define NCO1ACC2                         BANKMASK(NCO1ACCL), 2
#define NCO1ACC3                         BANKMASK(NCO1ACCL), 3
#define NCO1ACC4                         BANKMASK(NCO1ACCL), 4
#define NCO1ACC5                         BANKMASK(NCO1ACCL), 5
#define NCO1ACC6                         BANKMASK(NCO1ACCL), 6
#define NCO1ACC7                         BANKMASK(NCO1ACCL), 7
#define NCO1ACC8                         BANKMASK(NCO1ACCH), 0
#define NCO1ACC9                         BANKMASK(NCO1ACCH), 1
#define NCO1CKS0                         BANKMASK(NCO1CLK), 0
#define NCO1CKS1                         BANKMASK(NCO1CLK), 1
#define NCO1CKS2                         BANKMASK(NCO1CLK), 2
#define NCO1CKS3                         BANKMASK(NCO1CLK), 3
#define NCO1EN                           BANKMASK(NCO1CON), 7
#define NCO1IE                           BANKMASK(PIE2), 4
#define NCO1IF                           BANKMASK(PIR2), 4
#define NCO1INC0                         BANKMASK(NCO1INCL), 0
#define NCO1INC1                         BANKMASK(NCO1INCL), 1
#define NCO1INC10                        BANKMASK(NCO1INCH), 2
#define NCO1INC11                        BANKMASK(NCO1INCH), 3
#define NCO1INC12                        BANKMASK(NCO1INCH), 4
#define NCO1INC13                        BANKMASK(NCO1INCH), 5
#define NCO1INC14                        BANKMASK(NCO1INCH), 6
#define NCO1INC15                        BANKMASK(NCO1INCH), 7
#define NCO1INC16                        BANKMASK(NCO1INCU), 0
#define NCO1INC17                        BANKMASK(NCO1INCU), 1
#define NCO1INC18                        BANKMASK(NCO1INCU), 2
#define NCO1INC19                        BANKMASK(NCO1INCU), 3
#define NCO1INC2                         BANKMASK(NCO1INCL), 2
#define NCO1INC3                         BANKMASK(NCO1INCL), 3
#define NCO1INC4                         BANKMASK(NCO1INCL), 4
#define NCO1INC5                         BANKMASK(NCO1INCL), 5
#define NCO1INC6                         BANKMASK(NCO1INCL), 6
#define NCO1INC7                         BANKMASK(NCO1INCL), 7
#define NCO1INC8                         BANKMASK(NCO1INCH), 0
#define NCO1INC9                         BANKMASK(NCO1INCH), 1
#define NCO1OUT                          BANKMASK(NCO1CON), 5
#define NCO1PFM                          BANKMASK(NCO1CON), 0
#define NCO1POL                          BANKMASK(NCO1CON), 4
#define NCO1PWS0                         BANKMASK(NCO1CLK), 5
#define NCO1PWS1                         BANKMASK(NCO1CLK), 6
#define NCO1PWS2                         BANKMASK(NCO1CLK), 7
#define NSS                              BANKMASK(DAC1CON), 0
#define NVMADR0                          BANKMASK(NVMADRL), 0
#define NVMADR1                          BANKMASK(NVMADRL), 1
#define NVMADR10                         BANKMASK(NVMADRH), 2
#define NVMADR11                         BANKMASK(NVMADRH), 3
#define NVMADR12                         BANKMASK(NVMADRH), 4
#define NVMADR13                         BANKMASK(NVMADRH), 5
#define NVMADR14                         BANKMASK(NVMADRH), 6
#define NVMADR2                          BANKMASK(NVMADRL), 2
#define NVMADR3                          BANKMASK(NVMADRL), 3
#define NVMADR4                          BANKMASK(NVMADRL), 4
#define NVMADR5                          BANKMASK(NVMADRL), 5
#define NVMADR6                          BANKMASK(NVMADRL), 6
#define NVMADR7                          BANKMASK(NVMADRL), 7
#define NVMADR8                          BANKMASK(NVMADRH), 0
#define NVMADR9                          BANKMASK(NVMADRH), 1
#define NVMDAT0                          BANKMASK(NVMDATL), 0
#define NVMDAT1                          BANKMASK(NVMDATL), 1
#define NVMDAT10                         BANKMASK(NVMDATH), 2
#define NVMDAT11                         BANKMASK(NVMDATH), 3
#define NVMDAT12                         BANKMASK(NVMDATH), 4
#define NVMDAT13                         BANKMASK(NVMDATH), 5
#define NVMDAT2                          BANKMASK(NVMDATL), 2
#define NVMDAT3                          BANKMASK(NVMDATL), 3
#define NVMDAT4                          BANKMASK(NVMDATL), 4
#define NVMDAT5                          BANKMASK(NVMDATL), 5
#define NVMDAT6                          BANKMASK(NVMDATL), 6
#define NVMDAT7                          BANKMASK(NVMDATL), 7
#define NVMDAT8                          BANKMASK(NVMDATH), 0
#define NVMDAT9                          BANKMASK(NVMDATH), 1
#define NVMIE                            BANKMASK(PIE1), 0
#define NVMIF                            BANKMASK(PIR1), 0
#define NVMREGS                          BANKMASK(NVMCON1), 6
#define ODCA0                            BANKMASK(ODCONA), 0
#define ODCA1                            BANKMASK(ODCONA), 1
#define ODCA2                            BANKMASK(ODCONA), 2
#define ODCA4                            BANKMASK(ODCONA), 4
#define ODCA5                            BANKMASK(ODCONA), 5
#define ODCC0                            BANKMASK(ODCONC), 0
#define ODCC1                            BANKMASK(ODCONC), 1
#define ODCC2                            BANKMASK(ODCONC), 2
#define ODCC3                            BANKMASK(ODCONC), 3
#define ODCC4                            BANKMASK(ODCONC), 4
#define ODCC5                            BANKMASK(ODCONC), 5
#define OE0                              BANKMASK(DAC1CON), 4
#define OE1                              BANKMASK(DAC1CON), 5
#define OV                               BANKMASK(ADSTAT), 7
#define OVRA                             BANKMASK(CWG1STR), 4
#define OVRB                             BANKMASK(CWG1STR), 5
#define OVRC                             BANKMASK(CWG1STR), 6
#define OVRD                             BANKMASK(CWG1STR), 7
#define P1M1                             BANKMASK(CCP1CON), 7
#define P2M1                             BANKMASK(CCP2CON), 7
#define PCH0                             BANKMASK(CM1PCH), 0
#define PCH1                             BANKMASK(CM1PCH), 1
#define PCH2                             BANKMASK(CM1PCH), 2
#define PCSC                             BANKMASK(ADCON1), 1
#define PEIE                             BANKMASK(INTCON), 6
#define PEN1                             BANKMASK(SSP1CON2), 2
#define PEN2                             BANKMASK(SSP2CON2), 2
#define PFM                              BANKMASK(NCO1CON), 0
#define POLA                             BANKMASK(CWG1CON1), 0
#define POLB                             BANKMASK(CWG1CON1), 1
#define POLC                             BANKMASK(CWG1CON1), 2
#define POLD                             BANKMASK(CWG1CON1), 3
#define PPOL                             BANKMASK(ADCON1), 7
#define PPSLOCKED                        BANKMASK(PPSLOCK), 0
#define PRE0                             BANKMASK(ADPREL), 0
#define PRE1                             BANKMASK(ADPREL), 1
#define PRE10                            BANKMASK(ADPREH), 2
#define PRE11                            BANKMASK(ADPREH), 3
#define PRE12                            BANKMASK(ADPREH), 4
#define PRE2                             BANKMASK(ADPREL), 2
#define PRE3                             BANKMASK(ADPREL), 3
#define PRE4                             BANKMASK(ADPREL), 4
#define PRE5                             BANKMASK(ADPREL), 5
#define PRE6                             BANKMASK(ADPREL), 6
#define PRE7                             BANKMASK(ADPREL), 7
#define PRE8                             BANKMASK(ADPREH), 0
#define PRE9                             BANKMASK(ADPREH), 1
#define PREF0                            BANKMASK(ADREF), 0
#define PREF1                            BANKMASK(ADREF), 1
#define PREV0                            BANKMASK(ADPREVL), 0
#define PREV1                            BANKMASK(ADPREVL), 1
#define PREV10                           BANKMASK(ADPREVH), 2
#define PREV11                           BANKMASK(ADPREVH), 3
#define PREV12                           BANKMASK(ADPREVH), 4
#define PREV13                           BANKMASK(ADPREVH), 5
#define PREV14                           BANKMASK(ADPREVH), 6
#define PREV15                           BANKMASK(ADPREVH), 7
#define PREV2                            BANKMASK(ADPREVL), 2
#define PREV3                            BANKMASK(ADPREVL), 3
#define PREV4                            BANKMASK(ADPREVL), 4
#define PREV5                            BANKMASK(ADPREVL), 5
#define PREV6                            BANKMASK(ADPREVL), 6
#define PREV7                            BANKMASK(ADPREVL), 7
#define PREV8                            BANKMASK(ADPREVH), 0
#define PREV9                            BANKMASK(ADPREVH), 1
#define PS0                              BANKMASK(WDTCON), 1
#define PS1                              BANKMASK(WDTCON), 2
#define PS2                              BANKMASK(WDTCON), 3
#define PS3                              BANKMASK(WDTCON), 4
#define PS4                              BANKMASK(WDTCON), 5
#define PSIS                             BANKMASK(ADCON2), 7
#define PSS0                             BANKMASK(DAC1CON), 2
#define PSS1                             BANKMASK(DAC1CON), 3
#define PWM3EN                           BANKMASK(PWM3CON), 7
#define PWM3OUT                          BANKMASK(PWM3CON), 5
#define PWM3POL                          BANKMASK(PWM3CON), 4
#define PWM4EN                           BANKMASK(PWM4CON), 7
#define PWM4OUT                          BANKMASK(PWM4CON), 5
#define PWM4POL                          BANKMASK(PWM4CON), 4
#define PWM5EN                           BANKMASK(PWM5CON), 7
#define PWM5OUT                          BANKMASK(PWM5CON), 5
#define PWM5POL                          BANKMASK(PWM5CON), 4
#define PWS0                             BANKMASK(NCO1CLK), 5
#define PWS1                             BANKMASK(NCO1CLK), 6
#define PWS2                             BANKMASK(NCO1CLK), 7
#define RA0                              BANKMASK(PORTA), 0
#define RA1                              BANKMASK(PORTA), 1
#define RA2                              BANKMASK(PORTA), 2
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA5                              BANKMASK(PORTA), 5
#define RC0                              BANKMASK(PORTC), 0
#define RC1                              BANKMASK(PORTC), 1
#define RC1IE                            BANKMASK(PIE3), 3
#define RC1IF                            BANKMASK(PIR3), 3
#define RC2                              BANKMASK(PORTC), 2
#define RC2IE                            BANKMASK(PIE3), 5
#define RC2IF                            BANKMASK(PIR3), 5
#define RC3                              BANKMASK(PORTC), 3
#define RC4                              BANKMASK(PORTC), 4
#define RC5                              BANKMASK(PORTC), 5
#define RCEN1                            BANKMASK(SSP1CON2), 3
#define RCEN2                            BANKMASK(SSP2CON2), 3
#define RD                               BANKMASK(NVMCON1), 0
#define RD161                            BANKMASK(T1CON), 1
#define RD163                            BANKMASK(T3CON), 1
#define RDY                              BANKMASK(FVRCON), 6
#define READ_WRITE1                      BANKMASK(SSP1STAT), 2
#define READ_WRITE2                      BANKMASK(SSP2STAT), 2
#define REFRNG                           BANKMASK(DAC1CON), 6
#define REN                              BANKMASK(CWG1AS0), 6
#define RES0                             BANKMASK(ADRESL), 0
#define RES1                             BANKMASK(ADRESL), 1
#define RES10                            BANKMASK(ADRESH), 2
#define RES11                            BANKMASK(ADRESH), 3
#define RES12                            BANKMASK(ADRESH), 4
#define RES13                            BANKMASK(ADRESH), 5
#define RES14                            BANKMASK(ADRESH), 6
#define RES15                            BANKMASK(ADRESH), 7
#define RES2                             BANKMASK(ADRESL), 2
#define RES3                             BANKMASK(ADRESL), 3
#define RES4                             BANKMASK(ADRESL), 4
#define RES5                             BANKMASK(ADRESL), 5
#define RES6                             BANKMASK(ADRESL), 6
#define RES7                             BANKMASK(ADRESL), 7
#define RES8                             BANKMASK(ADRESH), 0
#define RES9                             BANKMASK(ADRESH), 1
#define RPT0                             BANKMASK(ADRPT), 0
#define RPT1                             BANKMASK(ADRPT), 1
#define RPT2                             BANKMASK(ADRPT), 2
#define RPT3                             BANKMASK(ADRPT), 3
#define RPT4                             BANKMASK(ADRPT), 4
#define RPT5                             BANKMASK(ADRPT), 5
#define RPT6                             BANKMASK(ADRPT), 6
#define RPT7                             BANKMASK(ADRPT), 7
#define RSEN1                            BANKMASK(SSP1CON2), 1
#define RSEN2                            BANKMASK(SSP2CON2), 1
#define RW1                              BANKMASK(SSP1STAT), 2
#define RW2                              BANKMASK(SSP2STAT), 2
#define R_W1                             BANKMASK(SSP1STAT), 2
#define R_W2                             BANKMASK(SSP2STAT), 2
#define R_nW1                            BANKMASK(SSP1STAT), 2
#define R_nW2                            BANKMASK(SSP2STAT), 2
#define SBOREN                           BANKMASK(BORCON), 7
#define SEN1                             BANKMASK(SSP1CON2), 0
#define SEN2                             BANKMASK(SSP2CON2), 0
#define SFOR                             BANKMASK(OSCSTAT), 1
#define SHUTDOWN                         BANKMASK(CWG1AS0), 7
#define SLCT0                            BANKMASK(CLCSELECT), 0
#define SLCT1                            BANKMASK(CLCSELECT), 1
#define SLCT2                            BANKMASK(CLCSELECT), 2
#define SLRA0                            BANKMASK(SLRCONA), 0
#define SLRA1                            BANKMASK(SLRCONA), 1
#define SLRA2                            BANKMASK(SLRCONA), 2
#define SLRA4                            BANKMASK(SLRCONA), 4
#define SLRA5                            BANKMASK(SLRCONA), 5
#define SLRC0                            BANKMASK(SLRCONC), 0
#define SLRC1                            BANKMASK(SLRCONC), 1
#define SLRC2                            BANKMASK(SLRCONC), 2
#define SLRC3                            BANKMASK(SLRCONC), 3
#define SLRC4                            BANKMASK(SLRCONC), 4
#define SLRC5                            BANKMASK(SLRCONC), 5
#define SMP1                             BANKMASK(SSP1STAT), 7
#define SMP2                             BANKMASK(SSP2STAT), 7
#define SOI                              BANKMASK(ADCON3), 3
#define SOR                              BANKMASK(OSCSTAT), 3
#define SOSCEN                           BANKMASK(OSCEN), 3
#define SOSCPWR                          BANKMASK(OSCCON3), 6
#define SSP1CLKPPS0                      BANKMASK(SSP1CLKPPS), 0
#define SSP1CLKPPS1                      BANKMASK(SSP1CLKPPS), 1
#define SSP1CLKPPS2                      BANKMASK(SSP1CLKPPS), 2
#define SSP1CLKPPS3                      BANKMASK(SSP1CLKPPS), 3
#define SSP1CLKPPS4                      BANKMASK(SSP1CLKPPS), 4
#define SSP1DATPPS0                      BANKMASK(SSP1DATPPS), 0
#define SSP1DATPPS1                      BANKMASK(SSP1DATPPS), 1
#define SSP1DATPPS2                      BANKMASK(SSP1DATPPS), 2
#define SSP1DATPPS3                      BANKMASK(SSP1DATPPS), 3
#define SSP1DATPPS4                      BANKMASK(SSP1DATPPS), 4
#define SSP1IE                           BANKMASK(PIE3), 6
#define SSP1IF                           BANKMASK(PIR3), 6
#define SSP1SSPPS0                       BANKMASK(SSP1SSPPS), 0
#define SSP1SSPPS1                       BANKMASK(SSP1SSPPS), 1
#define SSP1SSPPS2                       BANKMASK(SSP1SSPPS), 2
#define SSP1SSPPS3                       BANKMASK(SSP1SSPPS), 3
#define SSP1SSPPS4                       BANKMASK(SSP1SSPPS), 4
#define SSP2IE                           BANKMASK(PIE4), 0
#define SSP2IF                           BANKMASK(PIR4), 0
#define SSPEN1                           BANKMASK(SSP1CON1), 5
#define SSPEN2                           BANKMASK(SSP2CON1), 5
#define SSPM01                           BANKMASK(SSP1CON1), 0
#define SSPM02                           BANKMASK(SSP2CON1), 0
#define SSPM11                           BANKMASK(SSP1CON1), 1
#define SSPM12                           BANKMASK(SSP2CON1), 1
#define SSPM21                           BANKMASK(SSP1CON1), 2
#define SSPM22                           BANKMASK(SSP2CON1), 2
#define SSPM31                           BANKMASK(SSP1CON1), 3
#define SSPM32                           BANKMASK(SSP2CON1), 3
#define SSPOV1                           BANKMASK(SSP1CON1), 6
#define SSPOV2                           BANKMASK(SSP2CON1), 6
#define START1                           BANKMASK(SSP1STAT), 3
#define START2                           BANKMASK(SSP2STAT), 3
#define STAT0                            BANKMASK(ADSTAT), 0
#define STAT1                            BANKMASK(ADSTAT), 1
#define STAT2                            BANKMASK(ADSTAT), 2
